{
    "snapshots": [
        {
            "id": 1,
            "copyright": "\nJerry Zhang (left), \nBaolong Chen (photographer) & Amber Zhang (right)\n",
            "date": "2023-10-16",
            "explanation": "She knew everything but the question. She was well aware that there would be a complete annular eclipse of the Sun visible from their driving destination: Lake Abert in Oregon.  She knew that the next ring-of-fire eclipse would occur in the USA only in 16 more years, making this a rare photographic opportunity.  She was comfortable with the plan: that she and her boyfriend would appear in front of the eclipse in silhouette, sometimes alone, and sometimes together.  She knew that the annular phase of this eclipse would last only a few minutes and she helped in the many hours of planning.  She could see their friend who set up the camera about 400 meters away at the bottom of a ridge.  What she didn't know was the question she would be asked. But she did know the answer: \"yes\".   Album: Selected eclipse images sent in to APOD",
            "hdurl": "https://apod.nasa.gov/apod/image/2310/AnnularProposal_Zhang_3500.jpg",
            "media_type": "image",
            "service_version": "v1",
            "title": "Eclipse Rings",
            "url": "https://apod.nasa.gov/apod/image/2310/AnnularProposal_Zhang_960.jpg"
        },
        {
            "id": 2,
            "copyright": "\nVincenzo Mirabella (photographer)",
            "date": "2023-10-14",
            "explanation": "Want to see a ring around the Sun? It's easy to do in daytime skies around the world. Created by randomly oriented ice crystals in thin high cirrus clouds, circular 22 degree halos are visible much more often than rainbows. This one was captured by smart phone photography on May 29, 2021 near Rome, Italy. Carefully blocking the Sun, for example with a finger tip, is usually all that it takes to reveal the common bright halo ring. The halo's characteristic angular radius is about equal to the span of your hand, thumb to little finger, at the end of your outstretched arm. Want to see a ring of fire eclipse? That's harder. The spectacular annular phase of today's (October 14) solar eclipse, known as a ring of fire, is briefly visible only when standing along the Moon's narrow shadow track that passes over limited parts of North, Central, and South America. The solar eclipse is partial though, when seen from broader regions throughout the Americas.",
            "hdurl": "https://apod.nasa.gov/apod/image/2310/Vincenzo_Mirabella_20210529_134459_1024px.jpg",
            "media_type": "image",
            "service_version": "v1",
            "title": "Circular Sun Halo",
            "url": "https://apod.nasa.gov/apod/image/2310/Vincenzo_Mirabella_20210529_134459_1024px.jpg"  
        }
    ]
}